{
  "base_model_name_or_path": "/vepfs-cnbja62d5d769987/liushaokun/models/Llama-3.2-1B",
  "bias": "none",
  "enable_lora": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "lora_alpha": 16.0,
  "lora_dropout": 0.05,
  "lora_nums": 4,
  "merge_weights": false,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj"
  ],
  "task_type": "CAUSAL_LM"
}